fixing map format
